EmbJR/STM32_Bare_Metal_Practice/Ethernet_Port/STM32F0_LWIP/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include "rcc.h"
#include "gpio.h"
#include "uartF051.h"
#include "main.h"
#include "STM32F0Time.h"
#include "network.h"

uint8_t printdata[50];
ENC28J60_ConfigTypeDef encdevice = {
        .full_duplex = true,
        .auto_negotiation = true,
		//.mac_addr = {0x62,0x5F,0x70,0x72,0x61,0x79},
		.mac_addr = {0x00,0x04,0xA3,0x11,0x22,0x33},
};

uint8_t testbuff[] = {0xff,0xff,0xff,0xff,0xff,0xff,0x2c,0x60
					,0x0c,0xc8,0xbb,0xb6,0x08,0x06,0x00,0x01,0x08,0x00,0x06,0x04,0x00,0x01,0x2c,0x60
					,0x0c,0xc8,0xbb,0xb6,0xc0,0xa8,0x1d,0x11,0x00,0x00,0x00,0x00,0x00,0x00,0xc0,0xa8
					,0x1d,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
					,0x00,0x00,0x00,0x00};

volatile uint32_t timerTickCount = 0;

/* Private variables ---------------------------------------------------------*/
#define PSTRV(s) ((char *)(s))
static uint8_t myip[4] = {192,168,29,51};
static uint16_t mywwwport = 80;

#define BUFFER_SIZE 1500
uint8_t buf[BUFFER_SIZE+1],browser;
uint16_t plen;
char * ptr,*chr,chr2[20];
int b1,b2,iii,ij;

// Example configuration for 48MHz system clock using PLL from HSE
void SystemClock_Config_48MHz(void) {
    RCC_Config rcc_config;

    /* Configure RCC for 48MHz using PLL with HSI */
    rcc_config.system_clock_source = CLOCK_SOURCE_PLL;
    rcc_config.target_frequency = SYSTEM_CLOCK_48MHZ;
    rcc_config.hse_enabled = false;
    rcc_config.pll_enabled = true;
    rcc_config.pll_source = PLL_SOURCE_HSI_DIV2;
    rcc_config.pll_multiplier = 12;  /* HSI (8MHz/2) * 12 = 48MHz */
    rcc_config.ahb_prescaler = AHB_PRESCALER_1;
    rcc_config.apb_prescaler = APB_PRESCALER_1;
    rcc_config.hsi48_enabled = false;
    rcc_config.css_enabled = false;

    /* Initialize RCC */
    RCC_Init(&rcc_config);
}

void Delay_ms(uint32_t ms) {
    uint32_t i, j;
    for (i = 0; i < ms; i++) {
        for (j = 0; j < 8000; j++) {
            //__NOP();
        }
    }
}

/*============================================================================
 * Example 1: LED Blink (GPIO Output)
 *============================================================================*/
void Example_LED_Blink(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* Enable GPIOC clock for LED on PC8 */
    GPIO_EnableClock(GPIOC);

    /* Configure PC8 as output */
    GPIO_InitStruct.Pin = GPIO_PIN_8;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT;
    GPIO_InitStruct.Ot = GPIO_OTYPE_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    GPIO_InitStruct.Pull = GPIO_PULL_NO;
    GPIO_Init(GPIOC, &GPIO_InitStruct);
    GPIO_InitStruct.Pin = GPIO_PIN_9;
    GPIO_Init(GPIOC, &GPIO_InitStruct);

}

static void Timer2_Callback(void) {
    timerTickCount++;
    //GPIO_TogglePin(GPIOC, GPIO_PIN_8);
}

/* Microcontroller System Tick Handler (Must return system time in milliseconds) */
/* Replace with your MCU hardware tick getter (e.g., HAL_GetTick() for STM32)   */
uint32_t sys_now(void) {
    return timerTickCount;
}

void initializaTimer(void)
{
	uint32_t t2clk = STM32F0Timer_GetTimerClockHz(TIMER2);
	// TIMER2: 1 second = 1,000,000 us (1 Hz)
	if (!STM32F0Timer_ConfigurePeriodUs(TIMER2, t2clk, 1000)) {
		while (1);
	}

	STM32F0Timer_SetUpdateCallback(TIMER2, Timer2_Callback);

    // Enable update interrupts (NVIC priority in helper)
    STM32F0Timer_EnableUpdateInterrupt(TIMER2, true);

    // Start timers
    STM32F0Timer_Start(TIMER2);
}

void readVerifyReg(void)
{

}

uint8_t sampleStr[] = {0xff,0xff,0xff,0xff,0xff, 0xff, 0x62,0x5F,0x70,0x72,0x61,0x79, 0x08, 0x00, 0x00, 0x08, 'H','e','l','l','o','.','.','.','.'};
int main(void)
{
	uint8_t vnt = 0;
    uint16_t dat_p;
	SystemClock_Config_48MHz();
	Delay_ms(30);
	Example_LED_Blink();
	/* Initialize UART for interrupt mode at 115200 baud */
	uart1_initialize();
	initializaTimer();
	UART_SendStringIT(USART1, "System Starting...\n");
    ENC28J60_Init(&encdevice);
	init_network(encdevice.mac_addr,myip,mywwwport);

	ENC28J60_verify();
	//ethernet_Task();
    /* Loop forever */
    /* Main loop - toggle LED */
	//ENC28J60_SendPacket((uint8_t *)"Hellow....", sizeof("Hellow..."));
	//plen = sizeof(testbuff);	// test code
while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	//ENC28J60_SendPacket((uint8_t *)sampleStr, sizeof(sampleStr));
	Delay_ms(100);

	if(vnt++ > 50)
	{
		vnt = 0;
		ENC28J60_verify();
	}

	plen = ENC28J60_ReceivePacket(buf, BUFFER_SIZE);
        if(plen==0) continue;
        if(eth_is_arp(buf,plen)) {
            arp_reply(buf);
            continue;
        }
        if(eth_is_ip(buf,plen)==0) continue;
        if(buf[IP_PROTO]==IP_ICMP && buf[ICMP_TYPE]==ICMP_REQUEST) {
            icmp_reply(buf,plen);
            continue;
        }
        if(buf[IP_PROTO]==IP_TCP && buf[TCP_DST_PORT]==0 && buf[TCP_DST_PORT+1]==mywwwport) {
            if(buf[TCP_FLAGS] & TCP_SYN) {
                tcp_synack(buf);
                continue;
            }
            if(buf[TCP_FLAGS] & TCP_ACK) {
                init_len_info(buf);
                dat_p = get_tcp_data_ptr();
                if(dat_p==0) {
                    if(buf[TCP_FLAGS] & TCP_FIN) tcp_ack(buf);
                    continue;
                }
                
                if(strstr((char*)&(buf[dat_p]),"User Agent")) browser=0;
                else if(strstr((char*)&(buf[dat_p]),"MSIE")) browser=1;
                else browser=2;
                
                if(strncmp("/page",(char*)&(buf[dat_p+4]),5)==0){
                    ptr = (char*)&(buf[dat_p+4]);
                    //testpage();
                    //sendpage();
                    continue;
                }
            }
        }    
  }
}
